# -*- coding: utf-8 -*-
from flask import jsonify

error_list = {
    '00': u'请求成功',
    '01': u'用户名重复',
    '02': u'邮箱重复',
    '03': u'用户不存在',
    '04': u'密码不正确',
    # '000000': u'请求成功',
    # '999999': u'请求失败',
    # '999998': u'没有请求参数未包含签名',
    # '999997': u'没有请求参数未包含时间戳',
    # '999996': u'没有请求参数未包含随机数',
    # '999995': u'签名校验失败',
    # '999994': u'参数{0}为空',
    # '999993': u'请求接口前错误异常',
    # '999992': u'请求接口后错误异常',
    # '999990': u'服务维护中',
    #
    # # '10': u'平台API',
    # '100001': u'编码规则参数为空',
    #
    # # '1010': u'同步API',
    # '101001': u'最后同步时间为空',
    # '101002': u'时间格式有误',
    #
    # # 祥付宝 错误代码
    # '102001': u'交易已撤销',
    # '102002': u'交易已退款',
    # '102003': u'交易关闭',
    # '102004': u'密码错误',
    # '102005': u'请求交易失败',

}


class ApiResp():
    def resp(self, code=None, result=None):
        _dict = dict()
        _dict['code'] = code
        _dict['msg'] = error_list.get(code) if code else ''
        _dict['data'] = result
        return jsonify(**_dict)

api_resp = ApiResp()
